report/stage_6/profiling/async/wrk2_async_get.txt
$ wrk2 -c 128 -t 8 -d 65s -R 15000 -L -s ./scripts/get.lua http://localhost:8080/ >> output/wrk2_async_get.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.553ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.544ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.574ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.572ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.558ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.555ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.555ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.557ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.53ms    1.90ms  62.69ms   96.65%
    Req/Sec     1.98k   232.37     4.33k    81.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.26ms
 75.000%    1.70ms
 90.000%    2.20ms
 99.000%    7.55ms
 99.900%   30.38ms
 99.990%   42.33ms
 99.999%   58.69ms
100.000%   62.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.048     0.000000            1         1.00
       0.600     0.100000        82703         1.11
       0.789     0.200000       164989         1.25
       0.953     0.300000       247342         1.43
       1.109     0.400000       329671         1.67
       1.264     0.500000       412357         2.00
       1.341     0.550000       453158         2.22
       1.423     0.600000       494634         2.50
       1.507     0.650000       535543         2.86
       1.599     0.700000       577035         3.33
       1.699     0.750000       617854         4.00
       1.756     0.775000       638694         4.44
       1.818     0.800000       659174         5.00
       1.888     0.825000       679637         5.71
       1.970     0.850000       700226         6.67
       2.071     0.875000       720946         8.00
       2.131     0.887500       731176         8.89
       2.203     0.900000       741513        10.00
       2.291     0.912500       751869        11.43
       2.405     0.925000       762156        13.33
       2.557     0.937500       772340        16.00
       2.661     0.943750       777456        17.78
       2.793     0.950000       782589        20.00
       2.967     0.956250       787748        22.86
       3.211     0.962500       792888        26.67
       3.581     0.968750       798051        32.00
       3.843     0.971875       800612        35.56
       4.183     0.975000       803184        40.00
       4.595     0.978125       805755        45.71
       5.155     0.981250       808330        53.33
       5.823     0.984375       810902        64.00
       6.211     0.985938       812192        71.11
       6.663     0.987500       813477        80.00
       7.191     0.989062       814764        91.43
       7.839     0.990625       816050       106.67
       8.775     0.992188       817341       128.00
       9.391     0.992969       817985       142.22
      10.135     0.993750       818631       160.00
      11.079     0.994531       819269       182.86
      12.511     0.995313       819911       213.33
      14.743     0.996094       820555       256.00
      16.215     0.996484       820877       284.44
      17.951     0.996875       821201       320.00
      19.887     0.997266       821523       365.71
      21.791     0.997656       821842       426.67
      23.743     0.998047       822165       512.00
      24.863     0.998242       822325       568.89
      26.175     0.998437       822485       640.00
      27.551     0.998633       822648       731.43
      28.863     0.998828       822807       853.33
      30.559     0.999023       822972      1024.00
      31.407     0.999121       823048      1137.78
      32.335     0.999219       823132      1280.00
      33.247     0.999316       823209      1462.86
      34.367     0.999414       823290      1706.67
      35.487     0.999512       823371      2048.00
      36.031     0.999561       823411      2275.56
      36.607     0.999609       823452      2560.00
      37.215     0.999658       823491      2925.71
      38.079     0.999707       823532      3413.33
      38.879     0.999756       823571      4096.00
      39.199     0.999780       823592      4551.11
      39.711     0.999805       823612      5120.00
      40.191     0.999829       823632      5851.43
      40.927     0.999854       823652      6826.67
      41.599     0.999878       823672      8192.00
      41.919     0.999890       823682      9102.22
      42.431     0.999902       823692     10240.00
      43.135     0.999915       823702     11702.86
      43.967     0.999927       823713     13653.33
      45.151     0.999939       823722     16384.00
      46.271     0.999945       823727     18204.44
      48.671     0.999951       823732     20480.00
      49.343     0.999957       823737     23405.71
      50.623     0.999963       823742     27306.67
      52.287     0.999969       823747     32768.00
      52.479     0.999973       823750     36408.89
      53.311     0.999976       823752     40960.00
      54.847     0.999979       823755     46811.43
      55.327     0.999982       823757     54613.33
      56.575     0.999985       823760     65536.00
      56.863     0.999986       823761     72817.78
      57.343     0.999988       823762     81920.00
      58.687     0.999989       823764     93622.86
      58.719     0.999991       823765    109226.67
      59.391     0.999992       823766    131072.00
      59.935     0.999993       823767    145635.56
      59.935     0.999994       823767    163840.00
      60.639     0.999995       823768    187245.71
      60.767     0.999995       823769    218453.33
      60.767     0.999996       823769    262144.00
      60.863     0.999997       823770    291271.11
      60.863     0.999997       823770    327680.00
      60.863     0.999997       823770    374491.43
      62.431     0.999998       823771    436906.67
      62.431     0.999998       823771    524288.00
      62.431     0.999998       823771    582542.22
      62.431     0.999998       823771    655360.00
      62.431     0.999999       823771    748982.86
      62.719     0.999999       823772    873813.33
      62.719     1.000000       823772          inf
#[Mean    =        1.525, StdDeviation   =        1.898]
#[Max     =       62.688, Total count    =       823772]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  974467 requests in 1.08m, 67.40MB read
  Non-2xx or 3xx responses: 16207
Requests/sec:  14992.07
Transfer/sec:      1.04MB