report/stage_6/profiling/async/wrk2_async_put.txt
$ wrk2 -c 128 -t 8 -d 65s -R 15000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_async_put.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.029ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.037ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.035ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.041ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59ms    2.15ms  67.52ms   96.64%
    Req/Sec     1.98k   249.65     5.11k    85.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.72ms
 90.000%    2.23ms
 99.000%    8.94ms
 99.900%   31.53ms
 99.990%   45.09ms
 99.999%   58.17ms
100.000%   67.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.049     0.000000            1         1.00
       0.611     0.100000        82461         1.11
       0.800     0.200000       164925         1.25
       0.965     0.300000       247423         1.43
       1.121     0.400000       329730         1.67
       1.276     0.500000       412264         2.00
       1.356     0.550000       453554         2.22
       1.438     0.600000       494268         2.50
       1.525     0.650000       535586         2.86
       1.618     0.700000       576896         3.33
       1.720     0.750000       618100         4.00
       1.776     0.775000       638449         4.44
       1.839     0.800000       659027         5.00
       1.911     0.825000       679744         5.71
       1.995     0.850000       700280         6.67
       2.097     0.875000       720864         8.00
       2.161     0.887500       731389         8.89
       2.235     0.900000       741535        10.00
       2.329     0.912500       751789        11.43
       2.447     0.925000       761973        13.33
       2.625     0.937500       772282        16.00
       2.751     0.943750       777414        17.78
       2.917     0.950000       782564        20.00
       3.135     0.956250       787734        22.86
       3.457     0.962500       792879        26.67
       3.963     0.968750       798017        32.00
       4.335     0.971875       800601        35.56
       4.771     0.975000       803170        40.00
       5.303     0.978125       805733        45.71
       5.963     0.981250       808304        53.33
       6.735     0.984375       810880        64.00
       7.191     0.985938       812162        71.11
       7.723     0.987500       813447        80.00
       8.399     0.989062       814741        91.43
       9.319     0.990625       816023       106.67
      10.671     0.992188       817307       128.00
      11.623     0.992969       817956       142.22
      12.887     0.993750       818594       160.00
      14.679     0.994531       819239       182.86
      16.831     0.995313       819886       213.33
      19.295     0.996094       820525       256.00
      20.719     0.996484       820850       284.44
      22.095     0.996875       821168       320.00
      23.711     0.997266       821491       365.71
      25.151     0.997656       821816       426.67
      26.559     0.998047       822135       512.00
      27.391     0.998242       822296       568.89
      28.319     0.998437       822455       640.00
      29.439     0.998633       822618       731.43
      30.543     0.998828       822779       853.33
      31.695     0.999023       822939      1024.00
      32.463     0.999121       823022      1137.78
      33.343     0.999219       823099      1280.00
      34.207     0.999316       823179      1462.86
      35.359     0.999414       823260      1706.67
      36.671     0.999512       823342      2048.00
      37.215     0.999561       823381      2275.56
      37.919     0.999609       823425      2560.00
      38.815     0.999658       823461      2925.71
      39.551     0.999707       823504      3413.33
      40.383     0.999756       823542      4096.00
      41.375     0.999780       823563      4551.11
      42.303     0.999805       823583      5120.00
      42.815     0.999829       823602      5851.43
      43.775     0.999854       823624      6826.67
      44.383     0.999878       823643      8192.00
      44.831     0.999890       823652      9102.22
      45.343     0.999902       823663     10240.00
      46.335     0.999915       823673     11702.86
      47.359     0.999927       823682     13653.33
      48.287     0.999939       823692     16384.00
      48.767     0.999945       823697     18204.44
      50.271     0.999951       823702     20480.00
      51.711     0.999957       823707     23405.71
      52.415     0.999963       823712     27306.67
      53.791     0.999969       823717     32768.00
      54.367     0.999973       823720     36408.89
      55.231     0.999976       823722     40960.00
      55.839     0.999979       823725     46811.43
      56.831     0.999982       823727     54613.33
      57.471     0.999985       823730     65536.00
      57.631     0.999986       823731     72817.78
      57.791     0.999988       823732     81920.00
      58.175     0.999989       823734     93622.86
      58.911     0.999991       823735    109226.67
      61.791     0.999992       823736    131072.00
      66.367     0.999993       823737    145635.56
      66.367     0.999994       823737    163840.00
      66.431     0.999995       823739    187245.71
      66.431     0.999995       823739    218453.33
      66.431     0.999996       823739    262144.00
      67.135     0.999997       823740    291271.11
      67.135     0.999997       823740    327680.00
      67.135     0.999997       823740    374491.43
      67.583     0.999998       823742    436906.67
      67.583     1.000000       823742          inf
#[Mean    =        1.589, StdDeviation   =        2.146]
#[Max     =       67.520, Total count    =       823742]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  974432 requests in 1.08m, 62.69MB read
  Non-2xx or 3xx responses: 15874
Requests/sec:  14991.70
Transfer/sec:      0.96MB